<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Propri&eacute;t&eacute;s du document</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="helpstyle.css" rel="stylesheet" type="text/css" />
</head>
<body>
<table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td class="title">Aide PDFCreator</td>
  </tr>
  <tr> 
    <td background="../images/grad.gif" height="20">&nbsp;</td>
  </tr>
  <tr> 
    <td>&nbsp;</td>
  </tr>
  <tr> 
    <td class="main"><p class="header">Propri&eacute;t&eacute;s du document</p>
      <p>Le chapitre concernant les propri&eacute;t&eacute;s du document permet de s&eacute;lectionner quelques propri&eacute;t&eacute;s g&eacute;n&eacute;rales des PDF cr&eacute;&eacute;s par PDFCreator.</p>
      <p><strong>Utiliser par d&eacute;faut l'auteur suivant :</strong> Cette option permet de d&eacute;finir un auteur qui sera utilis&eacute; chaque fois qu'un PDF est cr&eacute;&eacute;. Elle permet d'ajouter un suffixe &agrave; l'auteur du document tel que <em>Computername</em>, 
        <em>DateTime</em>, <em>Title</em>, <em>Username, ClientComputer, </em>et  
        les suffixes RedMon. Consultez la section <a href="autosave.htm">Enregistrement automatique</a> pour plus d'informations sur les suffixes.</p>
      <p><strong>Utiliser la date et l'heure courante pour la date de cr&eacute;ation :</strong> 
        coch&eacute;e, cette option utilise la date et l'heure courante au lieu des dates et heures auxquelles le document a &eacute;t&eacute; cr&eacute;&eacute;.</p>
      <p><strong>Une page par fichier :</strong> Cette option permet &agrave; l'utilisateur de cr&eacute;er un nouveau fichier pour chaque page du document d'origine. A cause d'une restriction de Ghostscript, cette option ne fonctionne pas pour les fichiers au format PDF et EPS.</p>
 <p><strong>Filigrane :</strong> Lorsqu'un texte est entr&eacute; &agrave; cet endroit, 
        PDFCreator ajoute un &quot;filigrane&quot; contenant ce texte au centre de chaque page du document. Vous pouvez changer la police du filigrane, sa couleur, sa taille et son remplissage. <strong><em>ATTENTION :</em></strong>
        Ces options sont vraiment exp&eacute;rimentales. Lorsque ces options sont utilis&eacute;es, certaine pages du document peuvent &ecirc;tre corrompues. V&eacute;rifiez votre PDF &agrave; la fin de l'impression.</p>
      <p><strong>Couleur de la police :</strong> Change la couleur de la police du filigrane.</p>
      <p><strong>Utiliser une police &eacute;vid&eacute;e :</strong> D&eacute;finit si une police &eacute;vid&eacute;e est utilis&eacute;e pour le texte du filigrane &agrave; la place d'un texte plein.<br />
        <em>Valeurs :</em><br />
        0 - Off (D&eacute;faut)<br />
        1 - On</p>
      <p><strong>Epaisseur de trait de la police :</strong> Si une police &eacute;vid&eacute;e est utilis&eacute;e, change l'&eacute;paisseur de trait de la police.</p>
      <p><strong>Utiliser une taille de papier fixe :</strong> Utilisez cette option pour fixer la taille du papier.</p>
      <p><strong>Utiliser une taille de papier personnalis&eacute;e :</strong> Ces deux options fixent la largeur et la hauteur souhait&eacute;es du papier en points (unit&eacute;s de 1/72 de pouce). L'option est utilis&eacute;e comme alternative &agrave; l'option <strong>Utiliser une taille de papier fixe</strong> et non en compl&eacute;ment.<br /></p>
   </td>
  </tr>
</table>
</body>
</html>

