<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Param&egrave;tres g&eacute;n&eacute;raux</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="helpstyle.css" rel="stylesheet" type="text/css" />
</head>
<body>
<table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td class="title">Aide PDFCreator</td>
  </tr>
  <tr> 
    <td background="../images/grad.gif" height="20">&nbsp;</td>
  </tr>
  <tr> 
    <td>&nbsp;</td>
  </tr>
  <tr> 
    <td class="main"><p class="header">Param&egrave;tres g&eacute;n&eacute;raux</p>
      <p>La page param&egrave;tres g&eacute;n&eacute;raux concerne les r&eacute;glages de base de l'application PDFCreator.</p>
      <p><strong>Imprimer la page de test :</strong> Cr&eacute;e une page PDF d'exemple pour tester l'imprimante PDFCreator et ses pilotes. Cela permet &agrave; l'utilisateur de cr&eacute;er un PDF sans avoir &agrave; utiliser un autre programme pour le test. C'est particuli&egrave;rment utile en cas de dysfonctionnement de PDFCreator sur votre syst&egrave;me.</p>
      <p><strong>Priorit&eacute; de traitement :</strong> La priorit&eacute; de traitement d&eacute;termine la quantit&eacute; de puissance de l'ordinateur utilis&eacute;e pour cr&eacute;er les PDF. Selon le r&eacute;glage, la rapidit&eacute; avec laquelle les PDF seront cr&eacute;&eacute;s augmentera ou diminuera. C'est utile sur un syst&egrave;me avec des ressources faibles.</p>
      <p><strong>Ne pas imprimer la file d'attente au d&eacute;marragede PDFCreator :</strong> Si vous activez cette option, PDFCreator ne d&eacute;marrera aucune impression. Vous pouvez lancer manuellement la conversion en allant dans le menu <em><strong>Document</strong></em> et en s&eacute;lectionnant <em><strong>Imprimer</strong></em>, ou en d&eacute;cochant la ligne <em><strong>Arr&ecirc;t</strong></em> dans le menu <em><strong>Imprimante</strong></em>.
        Cette option est utile si vous souhaitez rassembler plusieurs documents avant de les fusionner et de cr&eacute;er un PDF.</p>
      <p><strong>Ne pas confirmer la d&eacute;finition de PDFCreator comme imprimante par d&eacute;faut :</strong> 
        Occasionnellement, PDFCreator doit &ecirc;tre d&eacute;fini comme imprimante par d&eacute;faut pour accomplir certaines t&acirc;ches. Lorsqu'elle est activ&eacute;e, PDFCreator se d&eacute;finit lui-m&ecirc;me comme imprimante par d&eacute;faut pour accomplir son travail. Sinon, PDFCreator vous demande une confirmation avant de le faire lorsque c'est n&eacute;cessaire.</p>
      <p><strong>M&eacute;thode d'envoi des e-mails :</strong> Cette option permet &agrave; l'utilsiateur de choisir la fa&ccedil;on dont sont envoy&eacute;s les e-mails.<br />
        <em>Valeurs :</em><br />
        Automatique - PDFCreator d&eacute;tecte le client de messagerie par d&eacute;faut et d&eacute;termine la meilleure m&eacute;thode (D&eacute;faut)<br />
        Interface MAPI - PDFCreator utilise l'interface MAPI.<br />
        Utiliser sendmail.dll - PDFCreator utilises l'extension shell &quot;Send To/Mail Recipient&quot;.</p>
      <p><strong>Associer PDFCreator avec les fichiers Postscript :</strong> Lorsque vous cliquez sur ce bouton, PDFCreator devient l'application par d&eacute;faut pour ouvrir les fichiers Postscript 
        (.ps) sous Windows. Ne pas cliquer si vous souhaitez utiliser un autre programme par d&eacute;faut pour ces fichiers.</p>
      <p><strong>Couleur des bo&icirc;tes de dialogue :</strong> Avec ce r&eacute;glage, vous pouvez changer la couleur des cadres de bo&icirc;tes de dialogue. Cela peut &ecirc;tre utile pour les utilisateurs qui ont les yeux sensibles ou une vue d&eacute;ficiente.<br :>
        <em>Valeurs :</em> <br />
        1 - Rouge et bleu d&eacute;grad&eacute;s (D&eacute;faut)<br />
        2 - Rouge et bleu simple</p>
      <p><strong>Afficher une animation durant le traitement :</strong> Ce r&eacute;glage supprime l'animation affich&eacute;e durant la cr&eacute;ation d'un PDF ou d'un bitmap. Par d&eacute;faut l'animation est activ&eacute;e.<br /></p>
      <p><strong>Int&eacute;grer PDFCreator aux menus contextuels :</strong> Lorsque ce bouton est activ&eacute; PDFCreator est int&eacute;gr&eacute; &agrave; Windows. Lorsque vous faites un clic droit sur un document, une nouvelle ligne appara&icirc;tra dans le menu contextuel intitul&eacute;e &quot;Cr&eacute;er des fichiers PDF ou bitmap avec PDFCreator&quot;. Cele permet &agrave; l'utilisateur de convertir rapidement des documents en PDF sans avoir &agrave; ouvrir le document. Notez que l'usage de cette fonction requiert que PDFCreator soit temporairement d&eacute;fini comme imprimante par d&eacute;faut .</p>
      <p><strong>Supprimer l'int&eacute;gration aux menus contextuels :</strong> Lorsque on clique, PDFCreator n'appara&icirc;t plus dans les menus contextuels de Windows.</p>
   </td>
  </tr>
</table>
</body>
</html>