<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Dokumenteinstellungen</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="helpstyle.css" rel="stylesheet" type="text/css" />
</head>
<body>
<table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td class="title">PDFCreator Hilfe</td>
  </tr>
  <tr> 
    <td background="../images/grad.gif" height="20">&nbsp;</td>
  </tr>
  <tr> 
    <td>&nbsp;</td>
  </tr>
  <tr> 
    <td class="main"><p class="header">Dokumenteinstellungen</p>
      <p>Die Dokumenteinstellungen erlauben dem Benutzer allgemeine Einstellungen 
        f&uuml;r alle von PDFCreator erstellten Dokumente festzulegen.</p>
      <p><strong>Standardautor festlegen:</strong> Wenn dieses Einstellung aktiviert wurde, 
        wird ein Standardautor zu jeder erstellen PDF-Datei hinzugef&uuml;gt. Es 
        k&ouml;nnen auch zus&auml;tzliche Felder zum Namen, wie <em>Computername</em>, 
        <em>DateTime</em>, <em>Title</em>, und <em>Username, ClientComputer</em> und
        die Redmon-Variablen hinzugef&uuml;gt werden. Weitere Hinweise dazu siehe 
      <a href="autosave.htm">Automatisches Speichern</a>.</p>
      <p><strong>Benutze aktuelles Datum als 'Erstellungsdatum':</strong> Wenn 
        dieses Feld angekreuzt ist, wird die aktuelle Zeit anstelle der Zeit, 
        zu der das Dokument urspr&uuml;nglich erstellt wurde, benutzt.</p>
      <p><strong>Eine Seite je Datei:</strong> Die Einstellung erlaubt Benutzern eine
        neue Datei f&uuml;r jede Seite des Originals zu erstellen. Aufgrund von
        Einschr&auml;nkungen in Ghostscript funktioniert das nicht mit PDF und
        EPS Dateien.</p>
      <p><strong>Stempelzeichenkette:</strong> Wenn diese Einstellung gesetzt ist, legt
        PDFCreator einen Stempel &uuml;ber das Dokument. Sie k&ouml;nnen die Schriftart,
        Farbe, Gr&ouml;&szlig;e und Umrandung des Stempels mit den folgenden Einstellungen
        festlegen. Diese Einstellung ist noch sehr experimentell. Bitte kontrollieren Sie
        die erstellten Dokumente.</p>
      <p><strong>Schriftartfarbe:</strong> Legt die Farbe f&uuml;r den Stempeltext
        fest. Verwenden Sie daf&uuml;r HTML-Farben.<br>
        <em>Beispiel f&uuml;r Rot:</em> StampFontColor=#FF0000
      </p>
      <p><strong>Schriftumrandung verwenden:</strong> Diese Einstellung legt fest, ob
        eine Umrandung f&uuml;r den Stempeltext benutzt wird.<br>
        <em>Eigenschaften:</em><br>
        0 - Aus (Standard)<br>
        1 - Ein</p>
      <p><strong>Dicke der Schriftumrandung:</strong> Legt die Breite der Umrandung
        f&uuml;r den Stempeltext fest.</p>
      <p><strong>Feste Seitegr&ouml;&szlig;e verwenden:</strong> Diese Einstellung kann verwendet werden,
        um eine Standardpapiergr&ouml;&szlig;e vorzugeben.<br></p>
      <p><strong>Benutzerdefinierte Seitengr&ouml;&szlig;e verwenden:</strong> Diese beiden Einstellungen
        legen eine fest vorgegebene Breite und H&ouml;he f&uuml;r das zu verwendene Papierformat fest.
        Die Einheit ist 1/72 eines Zolls und kann als Alternative f&uuml;r die Einstellung
        <strong>Feste Seitegr&ouml;&szlig;e verwenden</strong> verwendet werden, aber nicht in Kombination damit.<br></p>
   </td>
  </tr>
</table>
</body>
</html>

