<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Automatisches Speichern</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="helpstyle.css" rel="stylesheet" type="text/css" />
</head>
<body>
<table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td class="title">PDFCreator Hilfe</td>
  </tr>
  <tr>
    <td background="../images/grad.gif" height="20">&nbsp;</td>
  </tr>
  <tr>
    <td>&nbsp;</td>
  </tr>
  <tr>
    <td class="main"><p class="header">Automatisches Speichern</p>
      <p>"Automatisches Speichern" erlaubt Benutzern die automatische Erstellung von PDF-Dateien mit vordefinierten Einstellungen. Ist das "Automatische Speichern" aktiviert, wird nicht nach einem Dateinamen und nach einem Speicherort gefragt. Bereits existierende Dateien werden &uuml;berschrieben. Nachfolgend eine Liste der wichtigsten Parameter:</p>
      <ul>
        <li><strong>Format f&uuml;r automatisches Speichern: </strong>Das Dateiformat, welches f&uuml;r die automatische Speicherung verwendet werden soll.</li>
        <li><strong>Dateiname</strong>: Setzt einen Dateinamen, der f&uuml;r alle Dokumente gilt.</li>
        <li><strong>Dateinamen-Token hinzuf&uuml;gen: </strong>Mit Hilfe von Dateinamen-Token k&ouml;nnen Dateinamen individualisiert werden. So f&uuml;gt z.B. der Token &lt;DateTime&gt; das aktuelle Datum und die Zeit als Dateinamen ein.
         Folgende Tokens sind m&ouml;glich:
          <ul>
           <li>&lt;Author&gt; - Der Ersteller/Autor eines Dokumentes. Dies muss nicht immer der angemeldete Benutzer sein.</li>
           <li>&lt;Computername&gt; - Der Name des Rechners, auf dem PDFCreator installiert wurde.</li>
           <li>&lt;ClientComputer&gt; - Der Name oder die IP-Adresse des Rechners, der den Druckauftrag erstellt hat. Liegt eine Standardinstallation vor, entspricht der Clientcomputer dem Computernamen. Wurde die Serverinstallation gew&auml;hlt, ist der Clientcomputer der Rechner, der &uuml;ber die Freigabe des Druckers einen Druckauftrag erstellt hat. Der Token kann auch f&uuml;r das "Automatische Speichern"-Verzeichnis gew&auml;hlt werden, um so direkt auf dem Rechner, der den Druckauftrag erstellt hat, ein Dokument zu speichern (Bsp.: &quot;\\&lt;ClientComputer&gt;\c$\files&quot;).</li>
           <li>&lt;DateTime&gt; - F&uuml;gt das aktuelle Datum und die aktuelle Zeit ein.</li>
           <li>&lt;Title&gt; - F&uuml;gt den Dokumententitel ein.</li>
           <li>&lt;Username&gt; - F&uuml;gt den Benutzernamen des angemeldeten Benutzers ein.</li>
          </ul>
        </li>
        <li><strong>Verzeichnis:</strong> W&auml;hlen Sie f&uuml;r das automatische Speichern ein g&uuml;ltiges Verzeichnis aus. UNC-Pfadangaben sind hier erlaubt.
          Die folgenden Tokens k&ouml;nnen f&uuml;r das Verzeichnis gew&auml;hlt werden:</li>
          <ul>
            <li>&lt;MyFiles&gt; - Ist das Verzeichnis "Eigene Dateien" des Benutzers.</li>
            <li>&lt;MyDesktop&gt; - Steht f&uuml;r den Desktop des Benutzers.</li>
          </ul>
        </li>  
        <li><strong>Nach dem automatischen Speichern das Dokument mit dem Standardprogramm öffnen.:</strong> Ist diese Einstellung aktiviert, 
         wird nach dem automatischen Speichern das Dokument mit dem Standardprogramm ge&ouml;ffnet.
        </li>  
        <li><strong>Nach dem automatischen Speichern eine Email versenden:</strong> Erm&ouml;glich das Versenden einer Email nach dem
         automatischen Speichern einer Datei.
        </li>
      </ul>
      <p><strong><em>RedMon Tokens</em></strong><br>
        Alle Redmon-Umgebungsvariablen sind ebenfalls als Token verf&uuml;gbar.
        Diese Tokens sind nur verf&uuml;gbar wenn eine Datei gedruckt wird. Wird eine Postscript-Datei
        zum PDFCreator-Druckmonitor hinzugef&uuml;gt, wird diese Datei nicht gedruckt und diese Variablen
        sind folglich leer. Es folgt die List der zur Verf&uuml;gung stehenden Variablen.
      </p>
      <table border="1" cellpadding="1" style="border-collapse:collapse;empty-cells:show;">
       <tr>
        <td nowrap><strong>REDMON_DOCNAME:</strong></td>
        <td>Der Name des Druckauftrages (z.B. &quot;Drucker Testseite&quot;) bzw. der Name des gedruckten Datei.</td>
       </tr>
       <tr>
        <td nowrap><strong>REDMON_DOCNAME_FILE:</strong></td>
        <td>Besteht <em>REDMON_DOCNAME</em> aus einem Dateinamen, enth&auml;lt diese Variable den Namen der Datei.</td>
       </tr>
       <tr>
        <td nowrap><strong>REDMON_DOCNAME_PATH:</strong></td>
        <td>Besteht <em>REDMON_DOCNAME</em> aus einem kompletten Dateinamen, enth&auml;lt diese Variable den Namen des
         Pfades. Wird diese Variable f&uuml;r das Verzeichnis verwendet, werden die Dateien in denselben Pfad wie die
         gedruckte Datei gespeichert.<br>
         <strong>Hinweis:</strong> Nur wenige Anwendungen (wie z.B. Autocad oder Irfanview) hinterlegen den kompletten
         Dateinamen. Deshalb sollte dieser Token nicht pauschal, sondern nur bei vorher getesteten Anwendungen
         eingesetzt werden.</td>
       </tr>
       <tr>
        <td nowrap><strong>REDMON_FILENAME:</strong></td>
        <td>Der Dateiname der Ausgebabedatei, falls die redmon-Dll andersweitig verwendet wird. Dies Variable ist im
         PDFCreator leer.</td>
       </tr>
       <tr>
        <td nowrap><strong>REDMON_JOB:</strong></td>
        <td>Die Auftragsnummer, dargestellt durch eine Zahl.</td>
       </tr>
       <tr>
        <td nowrap><strong>REDMON_MACHINE:</strong></td>
        <td>Der Name des Rechners, der den Druckauftrag erstellt hat (z.B. &quot;\\MyComputer&quot;).</td>
       </tr>
       <tr>
        <td nowrap><strong>REDMON_PORT:</strong></td>
        <td>Der Portname. F&uuml;r den PDFCreator wurde der Name &quot;PDFCREATOR:&quot; gew&auml;hlt. In anderen
         F&auml;llen lautet er normalerweise &quot;RPT1:&quot;.</td>
       </tr>
       <tr>
        <td nowrap><strong>REDMON_PRINTER:</strong></td>
        <td>Der Name des Druckers, normalerweise &quot;PDFCreator&quot;.</td>
       </tr>
       <tr>
        <td nowrap><strong>REDMON_USER:</strong></td>
        <td>Der Name es Benutzers, der den Druckauftrag erstellt hat (z.B. &quot;JOHNDOE&quot;).</td>
       </tr>
       <tr>
        <td nowrap><strong>REDMON_SESSIONID:</strong></td>
        <td>Die Sitzungs-ID einer Terminalserver-Sitzung. Der Wert ist Null, falls PDFCreator nicht auf einem
         Terminalserver installiert wurde.</td>
       </tr>
      </table>
      <p><strong>Hinweis:</strong> Wenn Sie PDF Sicherheiteinstellungen bei der <em>Automatischen Speicherung</em>
       nutzen wollen, sehen Sie bitte unter <a href="hiddensettings.htm">versteckte Einstellungen</a> nach.</p>
    </td>
  </tr>
</table>
</body>
</html>