<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Allgemeine Einstellungen</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="helpstyle.css" rel="stylesheet" type="text/css" />
</head>
<body>
<table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td class="title">PDFCreator Hilfe</td>
  </tr>
  <tr> 
    <td background="../images/grad.gif" height="20">&nbsp;</td>
  </tr>
  <tr> 
    <td>&nbsp;</td>
  </tr>
  <tr> 
    <td class="main"><p class="header">Allgemeine Einstellungen</p>
      <p>Die allgemeinen Einstellungen legen Grundlegendes f&uuml;r PDFCreator 
        fest.</p>
      <p><strong>Testseite drucken:</strong> Erstellt eine Testseite.</p></td>
      <p><strong>Prozesspriorit&auml;t:</strong> Die Prozesspriorit&auml;t legt 
        fest, welchen Vorrang PDFCreator bei der Abrbeitung im Vergleich zu den anderen
        Anwendungen hat. 
        Das kann hilfreich sein, wenn das System eine niedrige Leistung hat und 
        nebenher noch andere Programme laufen sollen. PDFCreator kann dann weniger 
        Rechenzeit zur Verf&uuml;gung gestellt werden.</p>
      <p><strong>Keine Verarbeitung nach dem Start:</strong> Wird diese Einstellung aktiviert, beginnt PDFCreator nach
        dem Start nicht mit der Verarbeitung. Die Verarbeitung kann manuell gestartet werden, wenn &uuml;ber
        das Men&uuml; <em><strong>Dokument</em></strong> der Men&uuml;punkt <em><strong>Drucken</em></strong>
        gew&auml;hlt wird oder durch die Deaktivierung des Men&uuml;punktes <em><strong>Drucker anhalten</em></strong>
        im Men&uuml; <em><strong>Drucker</em></strong>. Diese Einstellung ist sinnvoll, wenn zun&auml;chst Dokumente
        im Druckmonitor gesammelt und diese dann sp&auml;ter verbunden bzw. einzeln verarbeitet
        werden sollen.<br>
      <p><strong>Keine Nachfragen beim Umschalten von PDFCreator als Standarddrucker:</strong> 
        Manchmal ist es notwendig, dass PDFCreator kurzzeitig zum Standarddrucker 
        wird, um bestimmte Vorg&auml;nge auszuf&uuml;hren. PDFCreator fragt dann 
        normalerweise, ob er vor&uuml;bergehend als Standarddrucker festgelegt werden soll.
        Wenn diese Option gesetzt ist, dann ist keine Zwischenfrage n&ouml;tig.</p>
      <p><strong>Methode zum Versenden einer Email:</strong> Legt das Verfahren fest wie eine Email
        erstellt werden soll.<br>
        <em>Eigenschaften:</em><br>
        Automatisch - Das Programm w&auml;hlt automatisch die beste Methode f&uuml;r das Versenden einer Email. (Standard)<br>
        Mapi-Schnittstelle - Das Programm verwendet die Mapi-Schnittstelle.<br>
        Sendmail.dll verwenden - Das Programm verwendet die "SendTo"-Methode des Windows-Explorers.</p>
      <p><strong>Verkn&uuml;pfe PDFCreator mit PostScript Dateien:</strong> Dieser 
        Button bewirkt, dass PDFCreator das Standardprogramm zum &Ouml;ffnen von 
        PostScript (PS) Dateien wird. Dr&uuml;cken Sie ihn nicht, wenn sie PS-Dateien
        in einem anderen Programm &ouml;ffnen m&ouml;chten.</p>
      <p><strong>Rahmenfarbe des Einstellungsdialoges:</strong> Mit dieser Einstellung k&ouml;nnen die Farben der Rahmen
        des Einstellungsdialoges ge&auml;ndert werden. Dies kann f&uuml;r Anwender mit Sehschw&auml;chen hilfreich sein.<br>
        <em>Eigenschaften:</em> <br>
         Rot and blauer Verlauf (Standard)<br>
         Einfache rote und blaue Farbe</p>
      <p><strong>Zeige eine Animation w&auml;hrend des Erstellungsprozesses:</strong> Diese Einstellung erm&ouml;glicht die Animation w&auml;hrend des
        Erstellungsprozesses aus- oder anzuschalten.</p>
      <p><strong>PDFCreator im Windows Explorer integrieren:</strong> Dieser Button 
        bewirkt, dass PDFCreator sich in den Windows Explorer integriert. Dann 
        erscheint im Kontextmen&uuml; von druckbaren Dokumenten die M&ouml;glichkeit &quot;Erzeuge 
        PDF mit PDFCreator&quot;. Diese Funktion erfordert, dass PDFCreator kurzzeitig 
        zum Standarddrucker wird.</p>
      <p><strong>Windows Explorerintegration entfernen:</strong> Entfernt die 
        oben beschriebene Integration von PDFCreator in den Windows Explorer.</p>
  </tr>
</table>
</body>
</html>
